const Survey = {
    "0": {
        "name": "Таблица настроения",
        "description": "Заполните таблицу в соответствии с вашим настроением в течение дня.",
        "questions": {
            "1": {
                "text": "Оцените ваше настроение по шкале от -3 до +3 (поставьте две галочки, если в течение дня вы испытывали и хорошее и иплохое настроение):",
                "type": "checkbox",
                "answers": {
                    "1": {
                        "text": "-3"
                    },
                    "2": {
                        "text": "-2"
                    },
                    "3": {
                        "text": "-1"
                    },
                    "4": {
                        "text": "Норма"
                    },
                    "5": {
                        "text": "1"
                    },
                    "6": {
                        "text": "2"
                    },
                    "7": {
                        "text": "3"
                    }
                }
            },
            "2": {
                "text": "Сколько часов вы спали?",
                "type": "textarea",
                "answers": {
                    "1": {
                        "text": "Напишите количество часо сна"
                    }
                }
            },
            "3": {
                "text": "Ваш уровень тревоги",
                "type": "radio",
                "answers": {
                    "1": {
                        "text": "0"
                    },
                    "2": {
                        "text": "1"
                    },
                    "3": {
                        "text": "2"
                    },
                    "4": {
                        "text": "3"
                    }
                }
            },
            "4": {
                "text": "Ваш уровень раздражительности",
                "type": "radio",
                "answers": {
                    "1": {
                        "text": "0"
                    },
                    "2": {
                        "text": "1"
                    },
                    "3": {
                        "text": "2"
                    },
                    "4": {
                        "text": "3"
                    }
                }
            },
            "5": {
                "text": "Какие медикаменты вы сегодня принимали?",
                "type": "textarea",
                "answers": {
                    "1": {
                        "text": "Напишите список выпитых сегодня таблеток"
                    }
                }
            },
            "6": {
                "text": "Принимали ли вы сегодня алкоголь?",
                "type": "checkbox",
                "answers": {
                    "1": {
                        "text": "Да"
                    },
                    "2": {
                        "text": "Нет"
                    },
                }
            },
            "7": {
                "text": "Принимали ли вы сегодня наркотики?",
                "type": "checkbox",
                "answers": {
                    "1": {
                        "text": "Да"
                    },
                    "2": {
                        "text": "Нет"
                    },
                }
            }
        },
        aggregate(someData) {
            // Как-то аггрегирует данные
        }
    },

};


exports.Survey = Survey;