const Survey = {
  "0": {
    "name": "Опрос для туберкулезников",
    "description": "Дневной опрос",
    "questions": {
      "1": {
        "text": "Количество кашля в течение дня",
        "type": "radio",
        "answers": {
          "1": {
            "text": "Часто"
          },
          "2": {
            "text": "Иногда"
          },
          "3": {
            "text": "Редко"
          },
          "4": {
            "text": "Однократно"
          }
        }
      },
      "2": {
        "text": "Количество отделяемой мокроты",
        "type": "radio",
        "answers": {
          "1": {
            "text": "Много"
          },
          "2": {
            "text": "Мало"
          },
          "3": {
            "text": "Средне"
          }
        }
      },
      "3": {
        "text": "Одышка",
        "type": "radio",
        "answers": {
          "1": {
            "text": "Часто"
          },
          "2": {
            "text": "Иногда"
          },
          "3": {
            "text": "Редко"
          },
          "4": {
            "text": "Однократно"
          }
        }
      },
      "7": {
        "text": "Оценить состояние дыхательной системы по шкале от 1 до 10",
        "type": "slider",
        "answers": {
          "1": {
            "text": "1"
          },
          "2": {
            "text": "2"
          },
          "3": {
            "text": "3"
          },
          "4": {
            "text": "4"
          },
          "5": {
            "text": "5"
          },
          "6": {
            "text": "6"
          },
          "7": {
            "text": "7"
          },
          "8": {
            "text": "8"
          },
          "9": {
            "text": "9"
          },
          "10": {
            "text": "10"
          }
        }
      },
      "16": {
        "text": "Комментарий в свободной форме:",
        "type": "textarea",
        "answers": {
          "1": {
            "text": "Текст внутри area"
          }
        }
      }
    },
    aggregate(someData){
      // Как-то аггрегирует данные
    }
  }
};

exports.Survey = Survey;